
create table pan_3db.categories(
    category_id int primary key auto_increment,
    category_name varchar(16)
);

insert into 
categories(category_name) values 
("食事処"),
("カフェ"),
("バー"),
("ラーメン"),
("レストラン"),

("蕎麦"),
("定食屋"),
("懐石料理"),
("スイーツ"),
("洋菓子店"),

("イタリア料理店"),
("居酒屋"),
("フランス料理"),
("中華料理店"),
("寿司"),

("ベーカリー"),
("ハンバーガー"),
("本場カレー");


create table pan_3db.locations(
    location_id int primary key auto_increment,
    location_x double,
    location_y double
);


create table pan_3db.shops(
    shop_id int primary key auto_increment,
    shop_name varchar(64),
    access varchar(32),
    address varchar(128),
    tel varchar(16),
    url varchar(128),
    info varchar(512),
    category_id int references categories(category_id),
    location_id int references locations(location_id)
);

insert into 
shops(shop_name,access,address,tel,url,info,category_id,location_id) values 
("カフェ小鹿","「八王子駅」南口 徒歩10分","〒192-0903 東京都八王子市万町122-1","163-163-163","https://hachioji.mypl.net/shop/00000353630/","一軒家を改装した古民家カフェ．かわいいクリームソーダがおすすめ．お部屋の貸し切りもできます．",2,1),
("喫茶フィーカ","「片倉台」徒歩2分、「片倉台小学校西」徒歩3分","〒192-0914 東京都八王子市片倉町1221-24","163-163-163","https://www.instagram.com/kissa_fika/?igshid=NTc4MTIwNjQ2YQ%3D%3D","珈琲と焼き菓子とコッペパンのお店．ポニーのロゴがかわいい．",2,2),
("中華そば専門店 大勝軒","「八王子駅」南口 徒歩4分","〒192-0904 東京都八王子市子安町4-26-6","163-163-163",null,"日本茶と中国茶が飲めるお店．アフタヌーンティーを楽しめるコースもある．マンションの二階にあるので隠れ家みたいでわくわく．",4,3),
("升階茶寮","「八王子駅」徒歩9分","〒192-0073東京都八王子市寺町29-12メゾン・ド・ミリオン202","163-163-163","http://saryou.or.tv/top.htm","小さな茶室のカフェ．薄暗い店内に置かれた暖かいランプがおしゃれ．",2,4),
("月待チ珈琲店","「八王子駅」徒歩26分","〒192-0914 東京都八王子市片倉町2405-1","163-163-163","https://www.instagram.com/tsukimachi_cafe/?igshid=1vq8gx2ibwgiv","少人数限定カフェ．八王子駅から東京工科大学に行くまでの大通りに面していて休憩場所にぴったり．",2,5),
("MUCHA CAFE ムチャカフェ",null,"東京都八王子市三崎町2-3 サンキョウビル 2F","163-163-163","https://www.hotpepper.jp/strJ000973506/map/#mapTop","ハンドメイドのソファーがおしゃれ．大人数でもはいれるので女子会や誕生日会にぴったり",2,6),
("コーヒースタンドと絵",null,"東京都八王子市子安町4-10-10 松屋ビル1F","163-163-163","http://caferitmos.net/menu/","店内で作品展示が楽しめるかわいいお店．コーヒーのテイクアウトもできます．",2,7),
("おばこ",null,"〒192-0914 東京都八王子市片倉町346","163-163-163","https://tabelog.com/tokyo/A1329/A132904/13236502/dtlphotolst/smp2/","昭和レトロな食堂．のんびり落ち着いて食事できるのでまったりしたい人に．",1,8),
("SOFA&DINE TUBO CAFE","「八王子駅」徒歩3分","〒192-0083 東京都八王子市旭町12-6 ロイビル3F","163-163-163","https://www.tubocafe.com/","ゆったりソファー．店内がおしゃれなのでいるだけでテンションあがります",2,9),
("中華そば つけ麺 音七","「八王子駅」徒歩1分","〒192-0904 東京都八王子市子安町４丁目１−１","163-163-163","https://tabelog.com/tokyo/A1329/A132904/13236502/dtlphotolst/smp2/","珍しいカレーラーメンがあるおみせ．つけ麺や塩ラーメンもあるので色々な味を楽しみたい人に．",4,10),
("COFFEE ritmos","「八王子駅」徒歩1分","東京都八王子市子安町4-10-10 松屋ビル1F","163-163-163","http://caferitmos.net/","絵描きの店主がカップスリーブに絵を描いてくれる、作品展示の出来るコーヒー屋．",2,11),
("Cafe Tiger1","「八王子駅」徒歩1分","〒192-0904 東京都八王子市子安町１丁目３−１５ 坂本ビル 1F","163-163-163","https://cafe-tiger1.business.site/","コスパが良くておいしい定食があります．",2,12),
("Music BAR TWIST","「八王子駅」徒歩2分","〒192-0904 東京都八王子市子安町1丁目6-8","163-163-163","https://musicbar-twist.com/","楽器演奏もできる雰囲気の良いバーです．",3,13),
("佐久田",null,"〒192-0904 東京都八王子市子安町1丁目8-14","163-163-163","https://sakuta093.wixsite.com/sakuta/blank","季節の食材を使った釜炊ご飯がおいしい．",4,14),
("LAMPCOFFEE",null,"〒192-0919 東京都八王子市七国1丁目9-1","163-163-163",null,"地域休憩所やWi-Fiがあるので勉強仕事したい人に．",2,15),
("喫茶店コスモス",null,"東京都八王子市子安町1-46-8","163-163-163",null,"レトロな雰囲気の喫茶店．定食屋さんのようなメニューもあるのでしっかりごはんを食べたい人にも．",2,16),
("洋食 ことり亭",null,"〒192-0916 東京都八王子市みなみ野3丁目11-4 ことり亭","163-163-163","https://kotoritei.com/","テレビでも紹介されたオムライスが絶品．",5,17),
("珈琲俱楽部 田",null,"〒192-0081 東京都八王子市横山町2-7 石川ビル 2F","163-163-163",null,"the「喫茶店」．webサイトはなく知る人ぞ知る良いお店…．",2,18),
("けいの家八王子本店",null,"〒192-0046 東京都八王子市明神町3丁目9-1 八王子ＭＫビル","163-163-163","https://kaitakushi.co.jp/","ランチの定食がコスパ抜群!",12,19),
("シフォンカフェ ボン・ムー",null,"〒192-0046 東京都八王子市明神町2丁目26-13","163-163-163",null,"シフォンケーキのお店．ドリンクメニューも豊富でほっと一息つきたい人におすすめ．",2,20),
("小川流 八王子みなみ野店",null,"〒192-0914 東京都八王子市片倉町1919−7","163-163-163","https://www.ra-menogawa.com/","煮干し醤油ラーメン．つけ麺がおいしい．",4,21),
("さんじ庵","「八王子みなみ野駅」 徒歩2分","〒192-0918 東京都八王子市兵衛1丁目25-5","999-999-999","http://sanjian.jp/","地元の食材を使った生粉打ちそば処．",5,22),
("峠茶屋",null,"〒192-0914 東京都八王子市片倉町1404","999-999-999",null,"東京工科大学近くの定食屋さん．",7,23),
("究極ラーメン 横濱家 八王子みなみ野店","「八王子みなみ野駅」 徒歩7分","〒192-0916 東京都八王子市みなみ野2丁目15-10","999-999-999","https://www.yokohama-ya.co.jp/","オリジナルの麺と豚骨スープが拘り．",4,24),
("佐久田",null,"〒192-0919 東京都八王子市七国1丁目9-1","999-999-999","https://sakuta093.wixsite.com/sakuta","慶事法事、歓送迎会等、ご家族の記念日等に．コース・単品両方あり．40名まで宴会の予約が可能．",8,25),
("イタリアン・トマト ケーキショップ 東京工場グランデ店",null,"〒192-0919 東京都八王子市七国1丁目30-3","999-999-999","http://www.italiantomato.co.jp/","ケーキとイタリアンのお店．",9,26),
("フランス焼き菓子・自家焙煎珈琲レドゥーシャ",null,null,null,null,null,10,27),
("Colline de vert ヴェールの丘",null,null,null,null,null,10,28),
("CASSI",null,null,null,null,null,11,29),
("五穀味噌らーめん 味噌屋蔵之介 八王子みなみ野店", null,null,null,null,null,4,30),
("Hako bu neco八王子店", null,null,null,null,"猫カフェ",2,31),
("けいの家 八王子みなみ野店",null,null,null,null,null,12,32),
("レジェ", null,null,null,null,null,13,33),
("焼そば 焼鳥 煌楽",null,null,null,null,null,1,34),
("Ultimate Base - ミニ四駆ミニッツサーキット&BAR -",null,null,null,null,null,3,35),
("中華料理 日中食堂",null,null,null,null,null,14,36),
("パペルブルグ", null,null,null,null,null,2,37),
("れんが亭",null,null,null,null,null,1,38),
("らあめん花月嵐 八王子片倉店",null,null,null,null,null,4,39),
("えびす丸",null,null,null,null,null,4,40),
("コーヒー ブリックス",null,null,null,null,null,2,41),
("三福",null,null,null,null,null,7,42),
("角喜鮨",null,null,null,null,null,15,43),
("尾張屋",null,null,null,null,null,6,44),
("ほっこり中華そば もつけ",null,null,null,null,null,4,45),
("つづきの台所のみくい",null,null,null,null,null,1,46),
("やきとり ごおで",null,null,null,null,null,12,47),
("三崎庵 支店",null,null,null,null,null,6,48),
("壱発ラーメン 八王子本店",null,null,null,null,null,4,49),
("北澤珈琲店",null,null,null,null,null,2,50),
("奥芝商店 八王子田代城",null,null,null,null,null,1,51),
("クレヨンハウス", null,null,null,null,null,10,52),
("焼肉ソウル",null,null,null,null,null,1,53),
("ビストロ・デ・トロワ",null,null,null,null,null,13,54),
("八王子メロンパン", null,null,null,null,null,16,55),
("Lupin",null,null,null,null,null,5,56),
("中華料理 上海厨房",null,null,null,null,null,14,57),
("Soul Grill",null,null,null,null,null,17,58),
("スリランカカレー ミリス",null,null,null,null,null,18,59),
("くらごはん",null,null,null,null,null,1,60);



insert into 
locations(location_x,location_y) values 
(35.655171488221,139.330824087732),
(35.631730503024,139.347545484659),
(35.680070268752,139.332709194681),
(35.654990976909,139.332658020720),
(35.639580351052,139.339501115296),

(35.656853420567,139.336915974996),
(35.653851722395,139.336915974996),
(35.643116844596,139.336915974996),
(35.657171974321,139.336915974996),
(35.655244983847,139.336645111377),

(35.653875831103,139.337797917070),
(35.653688265630,139.339588012578),
(35.653355261022,139.339739717511),
(35.624334435601,139.327736070303),
(35.653482428008,139.340566584593),

(35.653754201995,139.344306983191),
(35.631177976914,139.325727316582),
(35.660207636134,139.340084607391),
(35.655642745422,139.343909716307),
(35.658574911016,139.344261742039),

(35.630918729741,139.337602134743),
(35.631033836606,139.332378751271),
(35.625239579058,139.338025464817),
(35.627758380301,139.327529744276),
(35.624221094083,139.327656928460),

(35.622773434415,139.329745578583),
(35.621554159217,139.326986630840),
(35.634479670175,139.330541030394),
(35.635060365629,139.330533932761),
(35.634373482758,139.328303085408),

(35.630769071412,139.331215623753),
(35.631803598518,139.331458854067),
(35.631249766514,139.332503136070),
(35.632726158520,139.338915897528),
(35.627069912065,139.336706260213),

(35.626429893858,139.337047068397),
(35.620584888234,139.341137394261),
(35.635976152709,139.338986766132),
(35.636051291975,139.339547557750),
(35.639158485175,139.339848808378),

(35.641000000646,139.339169673615),
(35.643013936238,139.338483223686),
(35.642885740566,139.337372453875),
(35.642939489873,139.336883273586),
(35.653122756475,139.333217792759),

(35.652967239748,139.332952261683),
(35.652969793119,139.332956667896),
(35.652070964406,139.332531384372),
(35.654433670722,139.333761137826),
(35.654378970350,139.333880389667),

(35.654513403592,139.335175908423),
(35.655271748335,139.334837216233),
(35.655538434488,139.334930228039),
(35.655438982977,139.334966512394),
(35.655413409142,139.335209461857),

(35.655392704886,139.335356983354),
(35.656103320922,139.333240097169),
(35.655604008458,139.333961942762),
(35.656647345870,139.335387829844),
(35.657659652105,139.333920031646);





